@extends('layouts.master')

@section('title') @lang('translation.Dashboards') @endsection
@section('css')
<link href="{{asset('/assets/libs/sweetalert2/sweetalert2.min.css')}}" rel="stylesheet" type="text/css" />
<link href="/assets/libs/select2/select2.min.css" rel="stylesheet" type="text/css" />
<style>
  .can-click{
    cursor: pointer;
  }
  .btn-add-product{
    height: max-content;
  }
  .card {
    display:relative;
  }
  .status-warranty{
    position: absolute;
    left:0;
    width:2vw;
    height:100%;
    background-color:#5cb85c;
    border-radius: 0.25rem 0 0 0.25rem;
  }
  .status-process{
    position: absolute;
    left:0;
    width:2vw;
    height:100%;
    background-color:#ffc107;
    border-radius: 0.25rem 0 0 0.25rem;
  }
  .status-expired{
    position: absolute;
    left:0;
    width:2vw;
    height:100%;
    background-color:#d9534f;
    border-radius: 0.25rem 0 0 0.25rem;
  }
  .icon-btn{
    color: #000 !important;
  }
  .bxs-wrench{
    font-size:36px;
  }
  .select2-results__options{
      max-height:300px;
      overflow-y:auto;
  }
  .dropdown {
      position: relative;
      display: inline-block;
  }

  .dropdown-content {
      display: none;
      position: absolute;
      background-color: #ffffff;
      width: 100%;
      max-height:300px;
      overflow: auto;
      border: 1px solid #ddd;
      z-index: 20;
  }

  .dropdown-content a {
      color: black;
      padding: 12px 16px;
      text-decoration: none;
      display: block;
  }
  .show-dropdown{
    width:100%;
  }
  .dropdown a:hover {
      background-color: #ddd;
  }
  .is-invalid .select2-selection,
  .needs-validation~span>.select2-dropdown {
      border-color: red !important;
  }

  .custom-file-button input[type=file] {
    margin-left: -2px !important;
  }

  .custom-file-button input[type=file]::-webkit-file-upload-button {
    display: none;
  }

  .custom-file-button input[type=file]::file-selector-button {
    display: none;
  }

  .custom-file-button:hover label {
    background-color: #dde0e3;
    cursor: pointer;
  }
  .file-color {
    color: transparent !important;
  }
  .not-active{
    color:#909090;
  }
  .not-active:hover{
    color:#2b3042;
  }
  .input-search{
    min-width: 250px;
  }
</style>
@endsection
@section('content')
  @if (session('success'))
  <div class="alert alert-success" id="_success-alert">{{ session('success') }}</div>
  @elseif (session('error'))
  <div class="alert alert-danger" id="_error-alert">{{ session('error') }}</div>
  @endif
  <div class="card">
    <div class="card-body">
      <div class="d-flex justify-content-center">
        <div class="text-center">
          <h3 style="color:#87CEFA">เงื่อนไขการรับประกัน</h3>
          <h4 style="color:#87CEFA">โปรดอ่านรายละเอียดปลีกย่อยให้เข้าใจและชัดเจน</h4>  
        </div>   
      </div>
      <div class="col-sm-12">
        <p><b>การรับประกันสินสินค้า (Warranty Policy)</b></p>
        <p><b>เงื่อนไขการรับประกันผลิตภัณฑ์ </b>
        <br>&nbsp;&nbsp;&nbsp;1. เงื่อนไขการรับประกันผลิตภัณฑ์นี้มีผลบังคับเฉพาะผลิตภัณฑ์ที่จำหน่ายโดย บริษัท ดู เดย์ ดรีม จำกัด (มหาชน) และบริษัทในเครือ (“บริษัทฯ”) และ/หรือ ตัวแทนจำหน่ายที่ได้รับอนุญาตเท่านั้น โดยการรับประกันนี้ครอบคลุมถึงผลิตภัณฑ์ที่ซื้อในประเทศไทยและต่างประเทศ ท่านสามารถเข้ารับบริการได้ในประเทศที่ท่านซื้อผลิตภัณฑ์เท่านั้น
        <br>&nbsp;&nbsp;&nbsp;2. การเริ่มต้นวันรับประกันผลิตภัณฑ์ เริ่มนับตั้งแต่วันที่ในใบกำกับภาษีหรือใบเสร็จรับเงิน และสิ้นสุดระยะรับประกันตามระยะเวลาที่ระบุไว้ในข้อมูลระยะการรับประกันผลิตภัณฑ์ของผลิตภัณฑ์แต่ละประเภท 
        <br>&nbsp;&nbsp;&nbsp;3.	เมื่อต้องการใช้สิทธิ์การรับประกันท่านต้องแสดงหลักฐานพิสูจน์การซื้อ (ใบกำกับภาษี หรือ ใบเสร็จรับเงิน หรือ เอกสารใบรับประกัน หรือ การลงทะเบียนการรับประกันผลิตภัณฑ์ผ่านช่องทางการลงทะเบียนการรับประกันของบริษัทฯ) ดังนั้นโปรดเก็บรักษาต้นฉบับหลักฐานพิสูจน์การซื้อของท่านไว้และนำมาแสดงเพื่อยืนยันการขอรับบริการ โดยหลักฐานพิสูจน์การซื้อจะต้องมีข้อความสมบูรณ์และไม่มีรอยแก้ไขในสาระสำคัญ โดยนำมาแสดงเพื่อเข้ารับบริการต่อเจ้าหน้าที่ของบริษัทฯ ทุกครั้ง
        <br>&nbsp;&nbsp;&nbsp;4.	ในกรณีที่ไม่มีหลักฐานพิสูจน์การซื้อ หรือกรณีวันที่ซื้อไม่สามารถตรวจสอบได้จากใบกำกับภาษีหรือใบเสร็จรับเงิน บริษัทฯ ขอสงวนสิทธิ์ในการรับประกันผลิตภัณฑ์โดยขึ้นอยู่กับดุลยพินิจของบริษัทฯ
        <br>&nbsp;&nbsp;&nbsp;5.	รับประกันในกรณีที่อาการชำรุดเกิดจากความผิดพลาดของตัวเครื่องอันเนื่องมาจากความผิดพลาดจากการผลิตเท่านั้น
        <br>&nbsp;&nbsp;&nbsp;6.	ในการพิจารณาลักษณะความชำรุดบกพร่องของผลิตภัณฑ์ รวมไปถึงดุลยพินิจในการตัดสินใจเกี่ยวกับเงื่อนไขการรับประกันต่างๆ อันเกี่ยวกับผลิตภัณฑ์ทุกประการ ให้ถือว่าเจ้าหน้าที่ของบริษัทฯ เป็นผู้มีอำนาจดำเนินการและให้ถือว่าการพิจารณาดังกล่าวเป็นที่สุด 
        <br>&nbsp;&nbsp;&nbsp;7.	บริษัทฯ ขอสงวนสิทธิ์ทำการเปลี่ยนผลิตภัณฑ์หรือชิ้นส่วนที่เกี่ยวข้องกับผลิตภัณฑ์หรือชิ้นส่วนอย่างเดียวกันหรือที่เทียบเท่ากัน แทนการซ่อมแซมผลิตภัณฑ์หรือชิ้นส่วนนั้น ในกรณีที่มีการเปลี่ยนผลิตภัณฑ์หรือชิ้นส่วน ผลิตภัณฑ์หรือชิ้นส่วนที่ถูกเปลี่ยนจะเป็นกรรมสิทธิ์ของบริษัทฯ บริษัทฯ อาจทำการเปลี่ยนชิ้นส่วนต่างๆ ด้วยชิ้นส่วนที่ได้รับการปรับปรุงสภาพใหม่ ทั้งนี้ การเปลี่ยนผลิตภัณฑ์หรือชิ้นส่วนไม่เป็นการขยายหรือกลับไปเริ่มต้นระยะเวลาการรับประกันมาตรฐาน และการเปลี่ยนชิ้นส่วนในระหว่างระยะเวลาการรับประกันที่ขยายออกไปไม่เป็นการขยายหรือกลับไปเริ่มต้นระยะเวลาการรับประกันที่ขยายออกไปนั้น ถ้าผลิตภัณฑ์ถูกเปลี่ยนในระหว่างระยะเวลาการรับประกันที่ขยายออกไป การรับประกันที่ขยายออกไปนั้นจะสิ้นสุดลงโดยอัตโนมัติในเวลาที่ทำการเปลี่ยน
        <br>&nbsp;&nbsp;&nbsp;8.	หากท่านไม่มารับผลิตภัณฑ์ของท่านคืนภายใน 60 (หกสิบ) วันนับจากวันที่บริษัทฯ ได้แจ้งให้ทราบว่าผลิตภัณฑ์ของท่านได้รับการให้บริการเสร็จสิ้นแล้ว บริษัทฯ สงวนสิทธิ์ทำลายผลิตภัณฑ์และไม่ส่งผลิตภัณฑ์คืนกลับให้กับท่าน
        <br>&nbsp;&nbsp;&nbsp;9.	บริษัทฯ ขอสงวนสิทธิ์ในการเปลี่ยนแปลงเงื่อนไขการรับประกันผลิตภัณฑ์โดยไม่ต้องแจ้งให้ทราบล่วงหน้า
        <br>&nbsp;&nbsp;&nbsp;10.การตัดสินใจของบริษัทฯ ในเรื่องใดๆ ที่เกี่ยวกับความชำรุดบกพร่อง การผลิตหรือวัสดุของผลิตภัณฑ์ หรือเรื่องอื่นใดที่เกี่ยวกับการรับประกันจะเป็นที่ยุติ และท่านตกลงอย่างเพิกถอนไม่ได้ว่าจะปฏิบัติตามการตัดสินใจของบริษัทฯ
        <br>&nbsp;&nbsp;&nbsp;11.หากท่านมีความประสงค์จะส่งผลิตภัณฑ์ที่อยู่นอกเงื่อนไขการรับประกันผลิตภัณฑ์ให้บริษัทฯ ทำการซ่อม บริษัทฯ สงวนสิทธิ์ในการพิจารณารับซ่อม หากบริษัทฯ ตกลงที่จะให้บริการซ่อมแซมใดๆ ซึ่งอยู่นอกเหนือขอบเขตของการรับประกัน ท่านจะต้องชำระค่าบริการและค่าเดินทาง รวมทั้งค่าชิ้นส่วนทดแทนที่ใช้ไป ให้แก่บรษัทฯ ตามอัตราที่บริษัทฯ กำหนด ทั้งนี้ขึ้นอยู่กับดุลยพินิจของบริษัทฯ แต่เพียงผู้เดียว
        <br>&nbsp;&nbsp;&nbsp;12.ในกรณีที่ไม่พบความชำรุดบกพร่องในผลิตภัณฑ์ของบริษัทฯ ท่านจะต้องชำระค่าใช้จ่ายทั้งหมดที่เกิดขึ้น ซึ่งรวมถึงแต่ไม่จำกัดเพียงค่าบริการของบริษัทฯ และค่าเดินทาง
        <br>&nbsp;&nbsp;&nbsp;13.ระยะเวลาการรับประกันคือระยะเวลาที่ระบุไว้ในเอกสารใบรับประกัน ที่ท่านลงทะเบียนผ่านช่องทางการลงทะเบียนการรับประกันของบริษัทฯ การให้บริการใดๆ สำหรับผลิตภัณฑ์จะไม่ทำให้ระยะเวลาการรับประกันนี้ขยายออกไป
        <br>&nbsp;&nbsp;&nbsp;14.การรับประกันนี้ไม่สามารถโอนได้ และห้ามมิให้ทำการโอนสิทธิหรือหน้าที่ภายใต้ข้อกำหนดและเงื่อนไขนี้
        <br>&nbsp;&nbsp;&nbsp;15.บริษัทฯ มีสิทธิในการเรียกเก็บค่าบริการและค่าเดินทางสำหรับผลิตภัณฑ์นอกประกันตามอาการชำรุด แม้ในกรณีที่อาการชำรุดนั้นจะไม่ถูกตรวจพบในตอนแรกก็ตาม
        <br>&nbsp;&nbsp;&nbsp;16.บริษัทฯ สงวนสิทธิ์ในการปฏิเสธการเข้าบริการในพื้นที่ที่เข้าไม่ถึง, พื้นที่ที่ห้ามเข้า, พื้นที่ที่เสี่ยงอันตราย หรือพื้นที่อื่นใดที่บริษัทฯ เห็นว่าอาจก่อให้เกิดอันตรายได้</p>
        <p><b>ข้อยกเว้นการรับประกันผลิตภัณฑ์</b>
        <br>&nbsp;&nbsp;&nbsp;1. การรับประกันนี้ไม่ครอบคลุมถึงความเสียหาย การสูญหาย การทำงานที่ผิดปกติ ความชำรุดบกพร่อง หรือ กรณีอื่นๆที่เกิดขึ้นจากหรือเกี่ยวกับ (ก) เหตุสุดวิสัย (ข) ความประมาทเลินเล่อ (ค) อุบัติเหตุ (ง) ภัยธรรมชาติ (จ) ไฟไหม้ (ฉ) ฟ้าผ่า (ช) มลพิษ (ซ) แมลงหรือสัตว์อื่นๆ (ฌ) การกัดกร่อน (ญ) การแก้ไขดัดแปลงโดยไม่ได้รับอนุญาต (ฎ) การซ่อมแซมโดยบุคคลที่ไม่ได้รับการอนุญาตและอนุมัติจากบริษัทฯ (ฏ) การขาดการบำรุงรักษาหรือความระมัดระวัง หรือการไม่ได้บำรุงรักษาหรือใช้ความระมัดระวังอย่างเหมาะสม (ฐ) การใช้งานที่ผิดวิธีหรือการใช้งานที่ไม่ตรงตามวัตถุประสงค์ (ฑ) การติดตั้ง การตั้งค่า หรือการเชื่อมต่อหรือการใช้กระแสไฟฟ้าที่ไม่เหมาะสมหรือไม่ถูกต้อง (ฒ) ไฟตก ไฟเกิน แรงดันไฟฟ้าไม่ได้มาตรฐาน (ณ) หล่นตกน้ำ น้ำท่วม (ด) ส่วนที่เป็นการตกแต่งหรือพื้นผิวภายนอกของผลิตภัณฑ์ (ต) อุปกรณ์ใช้สิ้นเปลืองใดๆ (เช่น แบตเตอรี่ เทป ฯลฯ) หรือซอฟต์แวร์ที่ให้มาพร้อมกับผลิตภัณฑ์ (ถ) การใช้ผลิตภัณฑ์ร่วมกับผลิตภัณฑ์ อุปกรณ์เสริมหรือซอฟต์แวร์อื่น และ/หรือ (ท) กรณีที่หมายเลขเครื่องของผลิตภัณฑ์ถูกทำลายหรือหายไป บริษัทฯ และศูนย์บริการที่ได้รับการแต่งตั้ง สงวนสิทธิ์ในการเรียกเก็บค่าบริการและค่าอะไหล่ในการซ่อมเพื่อให้ผลิตภัณฑ์กลับมาใช้งานได้ตามปกติ ในกรณีที่ผลิตภัณฑ์ถูกใช้งานผิดไปจากเงื่อนไขการรับประกันตามที่ระบุไว้ข้างต้น
        <br>&nbsp;&nbsp;&nbsp;2. การสึกหรอโดยทั่วไปตามอายุการใช้งานและการฉีกขาด แตก หัก บิ่น งอ เบี้ยว ร้าว ทะลุ การสึกกร่อน ขึ้นสนิม รอยขูดขีด รอยเปรอะเปื้อน ความเสียหายที่เกิดขึ้นบนพื้นผิว แผ่นความร้อนดำ อุปกรณ์บางส่วนหลุดหายไป และภัยจากสัตว์หรือแมลงทำให้เกิดความเสียหาย
        <br>&nbsp;&nbsp;&nbsp;3. การใช้ชิ้นส่วนอุปกรณ์ อะไหล่อุปกรณ์ และ/หรืออุปกรณ์เสริม ที่ไม่ได้ประกอบหรือติดตั้งตามคำแนะนำของบริษัทฯ
        <br>&nbsp;&nbsp;&nbsp;4. การใช้ชิ้นส่วนอุปกรณ์ อะไหล่อุปกรณ์ และ/หรืออุปกรณ์เสริม ที่ไม่ใช่ชิ้นส่วนของแท้จากบริษัทฯ
        <br>&nbsp;&nbsp;&nbsp;5. การเรียกร้องค่าเสียหายหรือชิ้นส่วนประกอบที่หายไปจากตัวเครื่องหลังจากเลยกำหนด 7 (เจ็ด) วันนับจากวันที่ซื้อผลิตภัณฑ์
        <br>&nbsp;&nbsp;&nbsp;6. ส่วนประกอบใดๆ ซึ่งถูกเปลี่ยน ซ่อม หรือตรวจสอบ โดยชิ้นส่วนที่ไม่ได้จัดจำหน่าย หรือเห็นชอบโดยบริษัทฯ หรือ กระทำโดยบุคคลอื่นใดที่ไม่ใช่พนักงานหรือเจ้าหน้าที่จากบริษัทฯ และ/หรือศูนย์บริการที่ได้รับการแต่งตั้งจากบริษัทฯ
        <br>&nbsp;&nbsp;&nbsp;7. อาการชำรุดหรือผิดปรกติอันเนื่องมาจากการใช้งานเชิงพาณิชย์ เชิงอุตสาหกรรม หรือใช้ผิดวัตถุประสงค์ของคุณสมบัติในทางการใช้งานปกติของเครื่องใช้ไฟฟ้าในครัวเรือน
        <br>&nbsp;&nbsp;&nbsp;8. อาการผิดปกติที่เกิดจากการไม่ได้บำรุงรักษาและทำความสะอาดตามระยะเวลาอย่างเหมาะสม ทำให้อุปกรณ์ภายในเครื่องสกปรกและ/หรือ การติดตั้งที่ไม่ได้มาตรฐานหรือผิดวิธี การใช้ปลั๊ก หรือ สายไฟและตัวตัดไฟที่ไม่ได้มาตรฐาน หรือผิดขนาด ฯลฯ
        <br>&nbsp;&nbsp;&nbsp;9. การเพิกเฉย ละเลย หรือไม่ปฎิบัติตามคำแนะนำการใช้งานในคู่มือการใช้ผลิตภัณฑ์ที่ระบุไว้
        <br>&nbsp;&nbsp;&nbsp;10.ไม่รับประกันลำโพง อุปกรณ์ลำโพง และตัวรีโมทคอนโทรลทุกชนิด 
        <br>&nbsp;&nbsp;&nbsp;11.ฉลากผลิตภัณฑ์ถูกแก้ไข ลบ ขีดฆ่า สูญหายหรือทำลาย และ/หรือ เอกสารใบรับประกันถูกแก้ไข ปลอมแปลง หรือลบทิ้งไม่ว่ากรณีใดๆ
        <br>&nbsp;&nbsp;&nbsp;12.ไม่มีหลักฐานพิสูจน์การซื้อ และ/หรือการปลอมแปลงหลักฐานพิสูจน์การซื้อ (ใบกำกับภาษี หรือ ใบเสร็จรับเงิน หรือ เอกสารใบรับประกัน หรือ การลงทะเบียนการรับประกันผลิตภัณฑ์ผ่านช่องทางการลงทะเบียนการรับประกันของบริษัทฯ)
        <br>&nbsp;&nbsp;&nbsp;13.สำหรับผลิตภัณฑ์ที่มีเงื่อนไขพิเศษ ครอบคลุมไปถึงผลิตภัณฑ์ขายตามสภาพเฉพาะ ที่มีรอยขีดข่วน โค้งงอ รอยบุ๋ม แตกหัก โดยความเสียหายจากฟังก์ชันการทำงานของตัวเครื่องนับตั้งแต่วันที่ซื้อผลิตภัณฑ์ รวมไปถึงผลิตภัณฑ์ของแถม ผลิตภัณฑ์ตัวโชว์ ผลิตภัณฑ์สำหรับรางวัลร่วมสนุก ผลิตภัณฑ์ Clearance Sales และกรณีอื่นๆ จะอยู่นอกเหนือขอบเขตการรับประกัน โดยไม่สามารถขอเปลี่ยนเครื่องได้ในทุกกรณี
        <br>&nbsp;&nbsp;&nbsp;14.ผลิตภัณฑ์ที่มีสภาพชำรุดเสียหาย ผิดปกติและ/หรือเกิดอุบัติเหตุกับตัวผลิตภัณฑ์ อันเนื่องมาจากการขนส่งโดยท่าน
        <br>&nbsp;&nbsp;&nbsp;15.หากผลิตภัณฑ์สิ้นสุดระยะเวลารับประกันแล้ว บริษัทฯ ขอสงวนสิทธิ์ไม่รับผิดชอบต่อความเสียหายใดๆ ที่เกิดกับผลิตภัณฑ์ทุกกรณี 
        <br>&nbsp;&nbsp;&nbsp;16.การรับประกันนี้ไม่รวมถึงความแตกต่างเล็กน้อยที่เกิดขึ้นระหว่างภาพผลิตภัณฑ์ทางเว็บไซต์ โปสเตอร์ แผ่นพับ ใบปลิว โบรชัวร์ แคตตาล็อก หรือภาพจากสื่ออื่นๆ ของทางบริษัทฯ กับผลิตภัณฑ์จริงที่ได้รับ 
        <br>&nbsp;&nbsp;&nbsp;17.นอกจากเงื่อนไขการรับประกันผลิตภัณฑ์ที่ได้ระบุไว้ บริษัทฯ สงวนสิทธิ์ในการเป็นผู้วินิจฉัย และตัดสินใจว่าผลิตภัณฑ์นั้นๆ อยู่ในเงื่อนไขการรับประกันหรือไม่ โดยคำตัดสินของบริษัทฯ ถือเป็นที่สิ้นสุด 
        <br>&nbsp;&nbsp;&nbsp;18.บริษัทฯ ไม่ต้องรับผิดต่อความเสียหายโดยอ้อม ความเสียหายพิเศษ ความเสียหายที่เกี่ยวเนื่อง ค่าเสียหายที่กำหนดไว้เพื่อเป็นการลงโทษ ความเสียหายที่เกิดจากพฤติการณ์พิเศษ หรือความเสียหายทางเศรษฐกิจ หรือความสูญเสีย (ซึ่งรวมถึงการสูญเสียผลกำไร การใช้ประโยชน์ การประหยัดที่คาดหมายไว้ ค่าความนิยมหรือ การสูญเสียโอกาสทางธุรกิจ หรือการที่ข้อมูล ซอฟต์แวร์หรือสารสนเทศสูญหาย ถูกลบออกหรือถูกแก้ไข) อันเกิดขึ้นมาจากหรือเกี่ยวข้องกับการรับประกัน (ซึ่งรวมถึงบริการของบริษัทฯ ภายใต้การรับประกัน) โดยที่ความรับผิดของบริษัทฯ ภายใต้หรือที่เกี่ยวข้องกับการรับประกัน (ซึ่งรวมถึงบริการของบริษัทฯ ภายใต้การรับประกัน) จำกัดไว้เพียงค่าใช้จ่ายในการจัดเปลี่ยนผลิตภัณฑ์ด้วยผลิตภัณฑ์อย่างเดียวกันหรือผลิตภัณฑ์ที่เทียบเท่ากัน หรือค่าใช้จ่ายในการซ่อมแซมผลิตภัณฑ์ แล้วแต่ว่าจำนวนใดจะต่ำกว่า ทั้งนี้ บริษัทฯ ไม่ต้องรับผิดต่อการรับประกันอื่นๆ (ไม่ว่าจะเป็นการรับประกันอย่างแจ้งชัดหรือไม่ก็ตาม) ที่เกี่ยวกับผลิตภัณฑ์ ซึ่งรวมถึงแต่ไม่จำกัดเพียงการรับประกันที่ไม่ได้ระบุไว้อย่างชัดแจ้งสำหรับการนำผลิตภัณฑ์ไปใช้ในเชิงพาณิชย์หรือเพื่อวัตถุประสงค์ใดเป็นการเฉพาะ</p>
      </div>
    </div>
  </div>
  <!-- Modal -->
@endsection
@section('script')
  
  <script src="/assets/libs/select2/select2.min.js"></script>
  <script src="{{asset('/assets/libs/sweetalert2/sweetalert2.min.js')}}"></script>
@endsection
