<?php
 
return [
  'id' => 'รหัสลูกค้า',
  'firstname'=>'ชื่อ',
  'lastname'=>'นามสกุล',
  'phone'=>'เบอร์โทรศัพท์',
  'product-code'=>'รหัสสินค้า',
  'product-name'=>'ชื่อสินค้า',
  'brand'=>'ยี่ห้อสินค้า',
  'buying-date'=>'วันที่ซื้อสินค้า',
  'warranty-month'=>'การรับประกันสินค้า (เดือน)',
  'warranty-day'=>'การรับประกันสินค้าเพิ่มเติม (วัน)',
  'address1'=>'ที่อยู่1',
  'address2'=>'ที่อยู่2',
  'create-day'=>'วันที่ทำรายการ',
  'search-brand'=>'ค้นหายี่ห้อ',
  'begin'=>'เริ่ม',
  'to'=>'ถึง',
  'select-brand'=>'เลือกยี่ห้อ...',
  'exporting'=>'กำลังเตรียม...โปรดรอ',
  'done'=>'เสร็จสิ้น. ดาวน์โหลดไฟล์',
  'here'=>'ที่นี่'
];