<?php

return [
    'token_expire' => 'โทเคนหมดอายุ',
    'password'=>'รหัสผ่าน',
    'repassword'=>'รหัสผ่านอีกครั้ง',
    'reset'=>'เปลี่ยนรหัสผ่าน',
    'not_match'=>'รหัสผ่านไม่ตรงกัน',
    'old'=>'รหัสผ่านเป็นรหัสเดิม',
    'find-email'=>'หาอีเมลของคุณ',
    'find-email-detail'=>'ป้อนหมายเลขโทรศัพท์หรืออีเมลสำหรับการเปลี่ยนรหัสผ่าน',
    'find-email-label'=>'หมายเลขโทรศัพท์หรืออีเมล',
    'next'=>"ถัดไป",
    'send-reset'=>"ส่งการรีเซ็ตรหัสผ่านทางอีเมล",
    'send-reset-detail'=>"กรุณาตรวนสอบอีเมลของท่าน เพื่อทำการเปลี่ยนรหัสผ่าน หากไม่ได้รับอีเมลยืนยัน",
    'send-again'=>'ส่งอีครั้ง',
    'back'=>'ย้อนกลับ',
    'email'=>'อีเมล',
    'no-email'=>'ไม่มีอีเมลที่ลงทะเบียนไว้',
    'no-phone-email'=>'ไม่มีหมายเลขโทรศัพท์หรืออีเมลนี้',
    'theare-are-not-token'=>'ไม่มีโทเค็นนี้ในระบบ',
    'contact-admin'=>'ติดต่อแอดมิน',
];