<?php
 
return [
    'phone' => 'หมายเลขโทรศัพท์',
    'email'=>'อีเมล (ตัวเลือก)',
    'password'=>'รหัสผ่าน',
    'confirm'=>'ยืนยันรหัสผ่าน',
    'signup'=>'สมัคร',
    'phone_invalid'=>"หมายเลขโทรศัพท์ต้องมี 10 หลัก",
    'not_same'=>"รหัสผ่านไม่ตรงกัน",
    'is_use'=>"หมายเลขโทรศัพท์นี้ถูกใช้แล้ว",
    'email-invalid'=>"อีเมลต้องประกอบด้วย @",
    'not_upper'=>"รหัสผ่านต้องประกอบไปด้วย ตัวอักษรภาษาอังกฤตพิมพ์ใหญ่",
    'not_lower'=>"รหัสผ่านต้องประกอบไปด้วย ตัวอักษรภาษาอังกฤตพิมพ์เล็ก",
    'not_number'=>"รหัสผ่านต้องประกอบไปด้วย ตัวเลข",
    'not_length'=>"รหัสผ่านต้องมีความยาวตั้งแต่ 8 ตัวขึ้นไป",
    'not_pass_condition' => "รหัสผ่านไม่ผ่านเงื่อนไขทั้งหมด",
    'password_condition' => "เงื่อนไขการตั้งรหัสผ่าน",
];